yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_USB/STM32F2_usb_functions.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0
//
//  Copyright (c) Microsoft Corporation. All rights reserved.
//  Implementation for STM32F2: Copyright (c) Oberon microsystems, Inc.
//
//  *** USB OTG Full Speed Device Mode Driver ***
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#include <tinyhal.h>
#include <pal\com\usb\USB.h>

#ifdef STM32F4XX
#include "..\stm32f4xx.h"
#else
#include "..\stm32f2xx.h"
#endif

#include <usb_def.h>


#define USB_Debug(s)

#ifdef DEBUG
#define _ASSERT(x) ASSERT(x)
#else
#define _ASSERT(x)
#endif


#if !defined(STM32F2_USB_FS_USE_ID_PIN)
    #define STM32F2_USB_FS_USE_ID_PIN 0
#endif
#if !defined(STM32F2_USB_FS_USE_VB_PIN)
    #define STM32F2_USB_FS_USE_VB_PIN 0
#endif
#if !defined(STM32F2_USB_HS_USE_ID_PIN)
    #define STM32F2_USB_HS_USE_ID_PIN 0
#endif
#if !defined(STM32F2_USB_HS_USE_VB_PIN)
    #define STM32F2_USB_HS_USE_VB_PIN 0
#endif


#define MAX_EP0_SIZE 8      // control channel packet size
#define STM32F2_Num_EP_FS 4 // OTG FS supports 4 endpoints
#define STM32F2_Num_EP_HS 6 // OTG FS supports 6 endpoints


#if TOTAL_USB_CONTROLLER == 2
    // USB OTG Full Speed is controller 0
    // USB OTG High Speed is controller 1
    
    #define STM32F2_USB_REGS(c) (c ? OTG_HS : OTG_FS)
    
    #define STM32F2_USB_IS_HS(c) c
    #define STM32F2_USB_IDX(c) c
    #define STM32F2_USB_FS_IDX 0
    #define STM32F2_USB_HS_IDX 1
    
    #define STM32F2_USB_DM_PIN(c) (c ? 30 : 11) // B14,A11
    #define STM32F2_USB_DP_PIN(c) (c ? 31 : 12) // B15,A12
    #define STM32F2_USB_VB_PIN(c) (c ? 29 :  9) // B13,A9
    #define STM32F2_USB_ID_PIN(c) (c ? 28 : 10) // B12,A10
    
    #define STM32F2_USB_USE_ID_PIN(c) (c ? STM32F2_USB_HS_USE_ID_PIN : STM32F2_USB_FS_USE_ID_PIN)
    #define STM32F2_USB_USE_VB_PIN(c) (c ? STM32F2_USB_HS_USE_VB_PIN : STM32F2_USB_FS_USE_VB_PIN)
    #define STM32F2_USB_ALT_MODE(c) (GPIO_ALT_MODE)(c ? 0xC2 : 0xA2) // AF12,AF10
    
    #if USB_MAX_QUEUES <= STM32F2_Num_EP_FS
        #define USB_MAX_EP(c) USB_MAX_QUEUES
        #define USB_MAX_BUFFERS (2 * USB_MAX_QUEUES - 2)
    #elif USB_MAX_QUEUES <= STM32F2_Num_EP_HS
        #define USB_MAX_EP(c) (c ? USB_MAX_QUEUES : STM32F2_Num_EP_FS)
        #define USB_MAX_BUFFERS (USB_MAX_QUEUES + STM32F2_Num_EP_FS - 2)
    #else
        #define USB_MAX_EP(c) (c ? STM32F2_Num_EP_HS : STM32F2_Num_EP_FS)
        #define USB_MAX_BUFFERS (STM32F2_Num_EP_HS + STM32F2_Num_EP_FS - 2)
    #endif
    

#elif defined(STM32F2_USB_HS)
    // use USB OTG High Speed
    
    #define STM32F2_USB_REGS(c) OTG_HS
    
    #define STM32F2_USB_IS_HS(c) TRUE
    #define STM32F2_USB_IDX(c) 0
    #define STM32F2_USB_FS_IDX 0
    #define STM32F2_USB_HS_IDX 0

    #define STM32F2_USB_DM_PIN(c) 30 // B14
    #define STM32F2_USB_DP_PIN(c) 31 // B15
    #define STM32F2_USB_VB_PIN(c) 29 // B13
    #define STM32F2_USB_ID_PIN(c) 28 // B12
    
    #define STM32F2_USB_USE_ID_PIN(c) STM32F2_USB_HS_USE_ID_PIN
    #define STM32F2_USB_USE_VB_PIN(c) STM32F2_USB_HS_USE_VB_PIN
    #define STM32F2_USB_ALT_MODE(c) (GPIO_ALT_MODE)0xC2; // AF12

    #if USB_MAX_QUEUES <= STM32F2_Num_EP_HS
        #define USB_MAX_EP(c) USB_MAX_QUEUES
        #define USB_MAX_BUFFERS (USB_MAX_QUEUES - 1)
    #else
        #define USB_MAX_EP(c) STM32F2_Num_EP_HS
        #define USB_MAX_BUFFERS (STM32F2_Num_EP_HS - 1)
    #endif
    

#else
    // use OTG Full Speed
    
    #define STM32F2_USB_REGS(c) OTG_FS
    
    #define STM32F2_USB_IS_HS(c) FALSE
    #define STM32F2_USB_IDX(c) 0
    #define STM32F2_USB_FS_IDX 0
    #define STM32F2_USB_HS_IDX 0
    
    #define STM32F2_USB_DM_PIN(c) 11 // A11
    #define STM32F2_USB_DP_PIN(c) 12 // A12
    #define STM32F2_USB_VB_PIN(c)  9 // A9
    #define STM32F2_USB_ID_PIN(c) 10 // A10
    
    #define STM32F2_USB_USE_ID_PIN(c) STM32F2_USB_FS_USE_ID_PIN
    #define STM32F2_USB_USE_VB_PIN(c) STM32F2_USB_FS_USE_VB_PIN
    #define STM32F2_USB_ALT_MODE(c) (GPIO_ALT_MODE)0xA2; // AF10
    
    #if USB_MAX_QUEUES <= STM32F2_Num_EP_FS
        #define USB_MAX_EP(c) USB_MAX_QUEUES
        #define USB_MAX_BUFFERS (USB_MAX_QUEUES - 1)
    #else
        #define USB_MAX_EP(c) STM32F2_Num_EP_FS
        #define USB_MAX_BUFFERS (STM32F2_Num_EP_FS - 1)
    #endif
    
    
#endif


// FIFO sizes (in 32 bit words)
#define USB_RXFIFO_SIZE  64 // 256 bytes
#define USB_TX0FIFO_SIZE 64 // 256 bytes
#define USB_TXnFIFO_SIZE 64 // 256 bytes

// PHY turnaround time
// (4 AHB clocks + 1 Phy clock in Phy clocks)
#define STM32F2_USB_TRDT ((4 * 48000000 - 1) / SYSTEM_CYCLE_CLOCK_HZ + 2)


// State variables for one controller
typedef struct {
    USB_CONTROLLER_STATE state;
    UINT8 ep0Buffer[MAX_EP0_SIZE];
    UINT16 endpointStatus[USB_MAX_QUEUES];
    UINT16 EP_Type;
    UINT8 previousDeviceState;
    BOOL pinsProtected;
} STM32F2_USB_STATE;

/* State variables for the controllers */
static STM32F2_USB_STATE STM32F2_USB_ControllerState[TOTAL_USB_CONTROLLER];

/* Queues for all data endpoints */
Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[USB_MAX_BUFFERS];


/*
 * Suspend Event Interrupt Handler
 */
void STM32F2_USB_Driver_SuspendEvent (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State)
{
    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the device side
    
    USB_Debug("S");
    
    ((STM32F2_USB_STATE*)State)->previousDeviceState = State->DeviceState;
    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;
    USB_StateCallback( State );
}

