yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_USB/STM32F2_usb_functions.cpp
/*
 * Resume Event Interrupt Handler
 */
void STM32F2_USB_Driver_ResumeEvent (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State)
{
    USB_Debug("R");
    
    OTG->DCTL &= ~OTG_DCTL_RWUSIG; // remove remote wakeup signaling
    
    State->DeviceState = ((STM32F2_USB_STATE*)State)->previousDeviceState;
    USB_StateCallback( State );
}

/*
 * Reset Event Interrupt Handler
 */
void STM32F2_USB_Driver_ResetEvent (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State)
{
    USB_Debug("!");
    
    // reset interrupts and FIFOs
    OTG->GINTSTS = 0xFFFFFFFF; // clear global interrupts
    OTG->GRXFSIZ = USB_RXFIFO_SIZE; // Rx Fifo
    OTG->DIEPTXF0   = (USB_TX0FIFO_SIZE << 16) | USB_RXFIFO_SIZE; // Tx Fifo 0
    UINT32 addr = USB_RXFIFO_SIZE + USB_TX0FIFO_SIZE;
    for (int i = 0; i < State->EndpointCount; i++) {
        OTG->DIEPTXF[i] = (USB_TXnFIFO_SIZE << 16) | addr; // Tx Fifo i
        addr += USB_TXnFIFO_SIZE;
        OTG->DIEP[i].INT = 0xFF; // clear endpoint interrupts
        OTG->DOEP[i].INT = 0xFF;
        OTG->DIEP[i].CTL = OTG_DIEPCTL_EPDIS; // deactivate endpoint
        OTG->DOEP[i].CTL = OTG_DOEPCTL_EPDIS;
    }

    // flush FIFOs
    OTG->GRSTCTL = OTG_GRSTCTL_RXFFLSH | OTG_GRSTCTL_TXFFLSH | OTG_GRSTCTL_TXF_ALL;
    
    // configure control endpoint
    OTG->DIEP[0].CTL = OTG_DIEPCTL_USBAEP | 3; // Tx FIFO 0, 8 bytes packet size
    OTG->DOEP[0].CTL = OTG_DOEPCTL_USBAEP | 3;
    OTG->DIEP[0].TSIZ = 0;
    OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT; // up to 3 setup packets
    
    // configure data endpoints
    UINT32 intMask = 0x00010001; // ep0 interrupts;
    UINT32 eptype = ((STM32F2_USB_STATE*)State)->EP_Type >> 2; // endpoint types (2 bits / endpoint)
    UINT32 i = 1, bit = 2;
    while (eptype) {
        UINT32 type = eptype & 3;
        if (type != 0) { // data endpoint
            UINT32 ctrl = OTG_DIEPCTL_SD0PID | OTG_DIEPCTL_USBAEP;
            ctrl |= type << 18; // endpoint type
            ctrl |= State->MaxPacketSize[i]; // packet size
            if (State->IsTxQueue[i]) { // Tx (in) endpoint
                ctrl |= OTG_DIEPCTL_SNAK; // disable tx endpoint
                ctrl |= i << 22; // Tx FIFO number
                OTG->DIEP[i].CTL = ctrl; // configure in endpoint
                intMask |= bit; // enable in interrupt
            } else { // Rx (out) endpoint
                // Rx endpoints must be enabled here
                // Enabling after Set_Configuration does not work correctly
                OTG->DOEP[i].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[i];
                ctrl |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable rx endpoint
                OTG->DOEP[i].CTL = ctrl; // configure out endpoint
                intMask |= bit << 16; // enable out interrupt
            }
        }
        i++;
        eptype >>= 2;
        bit <<= 1;
    }
    
    // enable interrupts
    OTG->DIEPMSK = OTG_DIEPMSK_XFRCM; // transfer complete
    OTG->DOEPMSK = OTG_DOEPMSK_XFRCM | OTG_DOEPMSK_STUPM; // setup stage done
    OTG->DAINTMSK = intMask;   // enable ep interrupts
    OTG->GINTMSK = OTG_GINTMSK_OEPINT | OTG_GINTMSK_IEPINT | OTG_GINTMSK_RXFLVLM
                 | OTG_GINTMSK_USBRST | OTG_GINTMSK_USBSUSPM | OTG_GINTMSK_WUIM;
    
    OTG->DCFG &= ~OTG_DCFG_DAD; // reset device address
    
    /* clear all flags */
    USB_ClearEvent(0, USB_EVENT_ALL);

    State->FirstGetDescriptor = TRUE;

    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    State->Address = 0;
    USB_StateCallback( State );
}


/*
 * Data Endpoint Rx Interrupt Handler
 */
void STM32F2_USB_Driver_EP_RX_Int (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State,
                                   UINT32 ep, UINT32 count)
{
    ASSERT_IRQ_MUST_BE_OFF();
    
    UINT32* pd;

    if (ep == 0) { // control endpoint
        USB_Debug(count ? "c" : "0");
        
        pd = (UINT32*)((STM32F2_USB_STATE*)State)->ep0Buffer;
        State->Data = (BYTE*)pd;
        State->DataSize = count;
    } else { // data endpoint
        USB_Debug("r");
        
        BOOL full;
        USB_PACKET64* Packet64 = USB_RxEnqueue( State, ep, full );
        if (Packet64 == NULL) {  // should not happen
            USB_Debug("?");
            _ASSERT(0);
        }
        pd = (UINT32*)Packet64->Buffer;
        Packet64->Size = count;
    }

    // read data
    volatile UINT32* ps = OTG->DFIFO[ep];
    for (int c = count; c > 0; c -= 4) {
        *pd++ = *ps;
    }
        
    // data handling & Rx reenabling delayed to transfer completed interrupt
}

/*
 * Data In (Tx) Endpoint Interrupt Handler
 */
void STM32F2_USB_Driver_EP_In_Int (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State, UINT32 ep)
{
    ASSERT_IRQ_MUST_BE_OFF();
    
    UINT32 bits = OTG->DIEP[ep].INT;
    if (bits & OTG_DIEPINT_XFRC) { // transfer completed
        USB_Debug("3");
        OTG->DIEP[ep].INT = OTG_DIEPINT_XFRC; // clear interrupt
    }
    
    if (!(OTG->DIEP[ep].CTL & OTG_DIEPCTL_EPENA)) { // Tx idle
    
        UINT32* ps = NULL;
        UINT32 count;

        if (ep == 0) { // control endpoint
            if (State->DataCallback) { // data to send
                State->DataCallback( State );  // this call can't fail
                ps = (UINT32*)State->Data;
                count = State->DataSize;
                
                USB_Debug(count ? "x" : "n");
            }            
        } else if (State->Queues[ep] != NULL && State->IsTxQueue[ep]) { // Tx data endpoint
            USB_PACKET64* Packet64 = USB_TxDequeue( State, ep, TRUE );
            if (Packet64) {  // data to send
                ps = (UINT32*)Packet64->Buffer;
                count = Packet64->Size;
                
                USB_Debug("s");
            }
        }
        
        if (ps) { // data to send
            // enable endpoint
            OTG->DIEP[ep].TSIZ = OTG_DIEPTSIZ_PKTCNT_1 | count;
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_EPENA | OTG_DIEPCTL_CNAK;
            
            // write data
            volatile UINT32* pd = OTG->DFIFO[ep];
            for (int c = count; c > 0; c -= 4) {
                *pd = *ps++;
            }
        } else { // no data
            // disable endpoint
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_SNAK;
        }
    }
}

