yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_USB/STM32F2_usb_functions.cpp
/*
 * Handle Setup Data Received on Control Endpoint
 */
void STM32F2_USB_Driver_Handle_Setup (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State)
{
    /* send last setup packet to the upper layer */
    UINT8 result = USB_ControlCallback(State);

    switch(result) {

    case USB_STATE_DATA:
        /* setup packet was handled and the upper layer has data to send */
        break;

    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */
        USB_Debug("a");
        OTG->DCFG |= State->Address << 4; // set device address
        break;

    case USB_STATE_DONE:
        State->DataCallback = NULL;
        break;

    case USB_STATE_STALL:
        // setup packet failed to process successfully
        // set stall condition on the control endpoint
        OTG->DIEP[0].CTL |= OTG_DIEPCTL_STALL;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_STALL;
        USB_Debug("l");
        // ********** skip rest of function **********
        return;

    case USB_STATE_STATUS:
        break;

    case USB_STATE_CONFIGURATION:
        break;

    case USB_STATE_REMOTE_WAKEUP:
        // It is not using currently as the device side won't go into SUSPEND mode unless
        // the PC is purposely to select it to SUSPEND, as there is always SOF in the bus
        // to keeping the device from SUSPEND.
        USB_Debug("w");
        break;

    default:
        _ASSERT(0);
        break;            
    }

    // check ep0 for replies
    STM32F2_USB_Driver_EP_In_Int(OTG, State, 0);
    
    // check all Tx endpoints after configuration setup
    if (result == USB_STATE_CONFIGURATION) {
        for (int ep = 1; ep < State->EndpointCount; ep++) {
            if( State->Queues[ep] && State->IsTxQueue[ep] ) {
                STM32F2_USB_Driver_EP_In_Int(OTG, State, ep);
            }
        }
    }
}

/*
 * Data Out (Rx) Endpoint Interrupt Handler
 */
void STM32F2_USB_Driver_EP_Out_Int (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State, UINT32 ep)
{
    ASSERT_IRQ_MUST_BE_OFF();
    UINT32 bits = OTG->DOEP[ep].INT;
    if (bits & OTG_DOEPINT_XFRC) { // transfer completed
        USB_Debug("1");
        OTG->DOEP[ep].INT = OTG_DOEPINT_XFRC; // clear interrupt
    }
    if (bits & OTG_DOEPINT_STUP) { // setup phase done
        USB_Debug("2");
        OTG->DOEP[ep].INT = OTG_DOEPINT_STUP; // clear interrupt
    }
    
    if (ep == 0) { // control endpoint
        USB_Debug("$");
        // enable endpoint
        OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT | OTG_DOEPTSIZ_PKTCNT_1 | MAX_EP0_SIZE;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
        // Handle Setup data in upper layer
        STM32F2_USB_Driver_Handle_Setup(OTG, State);
    } else if (!State->Queues[ep]->IsFull()) {
        // enable endpoint
        OTG->DOEP[ep].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[ep];
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
    } else {
        // disable endpoint
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_SNAK;
        USB_Debug("v");
    }
}


/*
 * Main Interrupt Handler
 */
void STM32F2_USB_Driver_Interrupt (OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State)
{
    INTERRUPT_START;

    UINT32 intPend = OTG->GINTSTS; // get pending bits
    
    while (intPend & OTG_GINTSTS_RXFLVL) { // RxFifo non empty
        UINT32 status = OTG->GRXSTSP; // read and pop status word from fifo
        int ep = status & OTG_GRXSTSP_EPNUM;
        int count = (status & OTG_GRXSTSP_BCNT) >> 4;
        status &= OTG_GRXSTSP_PKTSTS;
        if (status == OTG_GRXSTSP_PKTSTS_PR    // data received
         || status == OTG_GRXSTSP_PKTSTS_SR) { // setup received
            STM32F2_USB_Driver_EP_RX_Int(OTG, State, ep, count);
        } else {
            // others: nothing to do
        }
        intPend = OTG->GINTSTS; // update pending bits
    }
    
    if (intPend & OTG_GINTSTS_IEPINT) { // IN endpoint
        UINT32 bits = OTG->DAINT & 0xFFFF; // pending IN endpoints
        int ep = 0;
        while (bits) {
            if (bits & 1) STM32F2_USB_Driver_EP_In_Int(OTG, State, ep);
            ep++;
            bits >>= 1;
        }         
    }
    
    if (intPend & OTG_GINTSTS_OEPINT) { // OUT endpoint
        UINT32 bits = OTG->DAINT >> 16; // pending OUT endpoints
        int ep = 0;
        while (bits) {
            if (bits & 1) STM32F2_USB_Driver_EP_Out_Int(OTG, State, ep);
            ep++;
            bits >>= 1;
        } 
    }
   
    if (intPend & OTG_GINTSTS_USBRST) { // reset
        STM32F2_USB_Driver_ResetEvent(OTG, State);
        OTG->GINTSTS = OTG_GINTSTS_USBRST; // clear interrupt
    }
    if (intPend & OTG_GINTSTS_USBSUSP) { // suspend
        STM32F2_USB_Driver_SuspendEvent(OTG, State);
        OTG->GINTSTS = OTG_GINTSTS_USBSUSP; // clear interrupt
    }
    if (intPend & OTG_GINTSTS_WKUPINT) { // wakeup
        STM32F2_USB_Driver_ResumeEvent(OTG, State);
        OTG->GINTSTS = OTG_GINTSTS_WKUPINT; // clear interrupt
    }
    
    INTERRUPT_END;
}

/*
 * OTG FS Interrupt Handler
 */
void STM32F2_USB_Driver_FS_Interrupt (void* param)
{
    STM32F2_USB_Driver_Interrupt(OTG_FS, &STM32F2_USB_ControllerState[STM32F2_USB_FS_IDX].state);
}

/*
 * OTG HS Interrupt Handler
 */
void STM32F2_USB_Driver_HS_Interrupt (void* param)
{
    STM32F2_USB_Driver_Interrupt(OTG_HS, &STM32F2_USB_ControllerState[STM32F2_USB_HS_IDX].state);
}


USB_CONTROLLER_STATE * CPU_USB_GetState( int Controller )
{
    if ((UINT32)Controller >= TOTAL_USB_CONTROLLER) return NULL;
    return &STM32F2_USB_ControllerState[STM32F2_USB_IDX(Controller)].state;
}

HRESULT CPU_USB_Initialize( int Controller )
{
    if ((UINT32)Controller >= TOTAL_USB_CONTROLLER) return S_FALSE;
    
    // enable USB clock
    if (STM32F2_USB_IS_HS(Controller)) { // HS on AHB1
        RCC->AHB1ENR |= RCC_AHB1ENR_OTGHSEN;
    } else { // FS on AHB2
        RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
    }
    
    USB_CONTROLLER_STATE *State = &STM32F2_USB_ControllerState[STM32F2_USB_IDX(Controller)].state;
    
    OTG_TypeDef* OTG = STM32F2_USB_REGS(Controller);

