yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_USB/STM32F2_usb_functions.cpp
    return TRUE;
}

BOOL CPU_USB_GetInterruptState() // Controller missing!
{
    return FALSE;
}

BOOL CPU_USB_ProtectPins( int Controller, BOOL On )
{
    USB_CONTROLLER_STATE *State = &STM32F2_USB_ControllerState[STM32F2_USB_IDX(Controller)].state;

    if (((STM32F2_USB_STATE*)State)->EP_Type == 0) return FALSE;  // not yet initialized

    OTG_TypeDef* OTG = STM32F2_USB_REGS(Controller);

    GLOBAL_LOCK(irq);

    if (On) {
        if (!((STM32F2_USB_STATE*)State)->pinsProtected) {

            USB_Debug("+");

            ((STM32F2_USB_STATE*)State)->pinsProtected = TRUE;

            // detach usb port
            OTG->DCTL |= OTG_DCTL_SDIS; // soft disconnect
            
            // clear USB Txbuffer
            for(int ep = 1; ep < State->EndpointCount; ep++) {
                if (State->Queues[ep] && State->IsTxQueue[ep]) {
                    while (USB_TxDequeue( State, ep, TRUE ) != NULL);  // clear TX queue
                }
            }

            State->DeviceState = USB_DEVICE_STATE_DETACHED;
            USB_StateCallback( State );

        }
    } else {
        if (((STM32F2_USB_STATE*)State)->pinsProtected) {

            USB_Debug("-");

            ((STM32F2_USB_STATE*)State)->pinsProtected = FALSE;

            GPIO_ALT_MODE altMode = STM32F2_USB_ALT_MODE(Controller);
            CPU_GPIO_DisablePin(STM32F2_USB_DM_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            CPU_GPIO_DisablePin(STM32F2_USB_DP_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            if (STM32F2_USB_USE_ID_PIN(Controller)) {
                CPU_GPIO_DisablePin(STM32F2_USB_ID_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            }
            
            // attach usb port
            OTG->DCTL &= ~OTG_DCTL_SDIS; // remove soft disconnect
            
            State->DeviceState = USB_DEVICE_STATE_ATTACHED;
            USB_StateCallback( State );
        }
    }

    return TRUE;
}

